app/controllers/api_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_parameters
    sign_in 'user', User.find(doorkeeper_token.resource_owner_id)